---
kind: property
id: P:Autodesk.Revit.DB.Visual.Metal.MetalPatternHeight
source: html/12a594ec-93fe-df53-c41a-6f0d907faf72.htm
---
# Autodesk.Revit.DB.Visual.Metal.MetalPatternHeight Property

The property labeled "Amount" from the "Metal" schema.

## Syntax (C#)
```csharp
public static string MetalPatternHeight { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 2".